back_end/app/controllers/spins_controller.rb

    def popular
        result = Spin.all.spin_count
---
SELECT "spins".* FROM "spins"

    def recent
        result = Spin.all.sort{|spin| spin.created_at}
---
SELECT "spins".* FROM "spins"