back_end/app/models/spin.rb

    def self.spin_count
        restaurants = []

        uniqueRestuarants = Spin.all.uniq{|restaurant| restaurant['yelp_id']}

        uniqueRestuarants.each{ |spin|
---
SELECT "spins".* FROM "spins"