app/controllers/adapter_controller.rb

INSERT INTO "spins" ("yelp_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["yelp_id", 0], ["name", "Kogane Ramen"], ["created_at", "2020-03-04 16:07:25.245460"], ["updated_at", "2020-03-04 16:07:25.245460"]]
---
    def yelpBusiness
        id = params[:id]
        results = Adapter.business(id)
        reviews = Adapter.business_reviews(id)
        Spin.create({yelp_id: results["id"], name: results["name"], url: results["url"]})