app/controllers/spins_controller.rb

SELECT "spins".* FROM "spins"
---
    def recent
        result = Spin.all.sort_by{|spin| -spin.id}